hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_ltdc.h
/*
; stm32N657_ltdc.
; ===============

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:	Generated using the .svd description	The 2025-01-01
; Modifs:
;
; Project:	uKOS-X
; Goal:		stm32N657_ltdc equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma	once

// LTDC address definitions
// ------------------------

typedef struct {
	volatile	uint32_t	RESERVED0[2];
	volatile	uint32_t	SSCR;
	volatile	uint32_t	BPCR;
	volatile	uint32_t	AWCR;
	volatile	uint32_t	TWCR;
	volatile	uint32_t	GCR;
	volatile	uint32_t	GC1R;
	volatile	uint32_t	GC2R;
	volatile	uint32_t	SRCR;
	volatile	uint32_t	GCCR;
	volatile	uint32_t	BCCR;
	volatile	uint32_t	RESERVED1;
	volatile	uint32_t	IER;
	volatile	uint32_t	ISR;
	volatile	uint32_t	ICR;
	volatile	uint32_t	LIPCR;
	volatile	uint32_t	CPSR;
	volatile	uint32_t	CDSR;
	volatile	uint32_t	RESERVED2[5];
	volatile	uint32_t	EDCR;
	volatile	uint32_t	IER2;
	volatile	uint32_t	ISR2;
	volatile	uint32_t	ICR2;
	volatile	uint32_t	LIPCR2;
	volatile	uint32_t	RESERVED3;
	volatile	uint32_t	ECRCR;
	volatile	uint32_t	CCRCR;
	volatile	uint32_t	RESERVED4[4];
	volatile	uint32_t	FUTR;
	volatile	uint32_t	RESERVED5[27];
	volatile	uint32_t	L1C0R;
	volatile	uint32_t	L1C1R;
	volatile	uint32_t	L1RCR;
	volatile	uint32_t	L1CR;
	volatile	uint32_t	L1WHPCR;
	volatile	uint32_t	L1WVPCR;
	volatile	uint32_t	L1CKCR;
	volatile	uint32_t	L1PFCR;
	volatile	uint32_t	L1CACR;
	volatile	uint32_t	L1DCCR;
	volatile	uint32_t	L1BFCR;
	volatile	uint32_t	L1BLCR;
	volatile	uint32_t	L1PCR;
	volatile	uint32_t	L1CFBAR;
	volatile	uint32_t	L1CFBLR;
	volatile	uint32_t	L1CFBLNR;
	volatile	uint32_t	L1AFBA0R;
	volatile	uint32_t	L1AFBA1R;
	volatile	uint32_t	L1AFBLR;
	volatile	uint32_t	L1AFBLNR;
	volatile	uint32_t	L1CLUTWR;
	volatile	uint32_t	RESERVED6[6];
	volatile	uint32_t	L1CYR0R;
	volatile	uint32_t	L1CYR1R;
	volatile	uint32_t	L1FPF0R;
	volatile	uint32_t	L1FPF1R;
	volatile	uint32_t	RESERVED7[33];
	volatile	uint32_t	L2C0R;
	volatile	uint32_t	L2C1R;
	volatile	uint32_t	L2RCR;
	volatile	uint32_t	L2CR;
	volatile	uint32_t	L2WHPCR;
	volatile	uint32_t	L2WVPCR;
	volatile	uint32_t	L2CKCR;
	volatile	uint32_t	L2PFCR;
	volatile	uint32_t	L2CACR;
	volatile	uint32_t	L2DCCR;
	volatile	uint32_t	L2BFCR;
	volatile	uint32_t	L2BLCR;
	volatile	uint32_t	L2PCR;
	volatile	uint32_t	L2CFBAR;
	volatile	uint32_t	L2CFBLR;
	volatile	uint32_t	L2CFBLNR;
	volatile	uint32_t	RESERVED8[4];
	volatile	uint32_t	L2CLUTWR;
	volatile	uint32_t	RESERVED9[6];
	volatile	uint32_t	L2CYR0R;
	volatile	uint32_t	L2CYR1R;
	volatile	uint32_t	L2FPF0R;
	volatile	uint32_t	L2FPF1R;
} LTDC_TypeDef;

#if (defined(__cplusplus))
#define	LTDC_NS	reinterpret_cast<LTDC_TypeDef *>(0x48001000u)
#define	LTDC_S	reinterpret_cast<LTDC_TypeDef *>(0x58001000u)

#else
#define	LTDC_NS	((LTDC_TypeDef *)0x48001000u)
#define	LTDC_S	((LTDC_TypeDef *)0x58001000u)
#endif

// SSCR Configuration

#define	LTDC_SSCR_HSW			(0xFFFFu<<16)
#define	LTDC_SSCR_HSW_0			(0x1u<<16)
#define	LTDC_SSCR_VSH			(0xFFFFu<<0)
#define	LTDC_SSCR_VSH_0			(0x1u<<0)

// BPCR Configuration

#define	LTDC_BPCR_AHBP			(0xFFFFu<<16)
#define	LTDC_BPCR_AHBP_0		(0x1u<<16)
#define	LTDC_BPCR_AVBP			(0xFFFFu<<0)
#define	LTDC_BPCR_AVBP_0		(0x1u<<0)

// AWCR Configuration

#define	LTDC_AWCR_AAW			(0xFFFFu<<16)
#define	LTDC_AWCR_AAW_0			(0x1u<<16)
#define	LTDC_AWCR_AAH			(0xFFFFu<<0)
#define	LTDC_AWCR_AAH_0			(0x1u<<0)

// TWCR Configuration

#define	LTDC_TWCR_TOTALW		(0xFFFFu<<16)
#define	LTDC_TWCR_TOTALW_0		(0x1u<<16)
#define	LTDC_TWCR_TOTALH		(0xFFFFu<<0)
#define	LTDC_TWCR_TOTALH_0		(0x1u<<0)

// GCR Configuration

#define	LTDC_GCR_HSPOL			(0x1u<<31)
#define	LTDC_GCR_VSPOL			(0x1u<<30)
#define	LTDC_GCR_DEPOL			(0x1u<<29)
#define	LTDC_GCR_PCPOL			(0x1u<<28)
#define	LTDC_GCR_SFSWTR			(0x1u<<25)
#define	LTDC_GCR_SFEN			(0x1u<<24)
#define	LTDC_GCR_CRCEN			(0x1u<<19)
#define	LTDC_GCR_DEN			(0x1u<<16)
#define	LTDC_GCR_DRW			(0x7u<<12)
#define	LTDC_GCR_DRW_0			(0x1u<<12)
#define	LTDC_GCR_DGW			(0x7u<<8)
#define	LTDC_GCR_DGW_0			(0x1u<<8)
#define	LTDC_GCR_DBW			(0x7u<<4)
#define	LTDC_GCR_DBW_0			(0x1u<<4)
#define	LTDC_GCR_GAMEN			(0x1u<<1)
#define	LTDC_GCR_LTDCEN			(0x1u<<0)

#define	LTDC_GCR_HSPOL_B_0X0	(0x0u<<31)
#define	LTDC_GCR_HSPOL_B_0X1	(0x1u<<31)
#define	LTDC_GCR_VSPOL_B_0X0	(0x0u<<30)
#define	LTDC_GCR_VSPOL_B_0X1	(0x1u<<30)
#define	LTDC_GCR_DEPOL_B_0X0	(0x0u<<29)
#define	LTDC_GCR_DEPOL_B_0X1	(0x1u<<29)
#define	LTDC_GCR_PCPOL_B_0X0	(0x0u<<28)
#define	LTDC_GCR_PCPOL_B_0X1	(0x1u<<28)
#define	LTDC_GCR_SFSWTR_B_0X0	(0x0u<<25)
#define	LTDC_GCR_SFSWTR_B_0X1	(0x1u<<25)
#define	LTDC_GCR_SFEN_B_0X0		(0x0u<<24)
#define	LTDC_GCR_SFEN_B_0X1		(0x1u<<24)
#define	LTDC_GCR_CRCEN_B_0X0	(0x0u<<19)
#define	LTDC_GCR_CRCEN_B_0X1	(0x1u<<19)
#define	LTDC_GCR_DEN_B_0X0		(0x0u<<16)
#define	LTDC_GCR_DEN_B_0X1		(0x1u<<16)
#define	LTDC_GCR_GAMEN_B_0X0	(0x0u<<1)
#define	LTDC_GCR_GAMEN_B_0X1	(0x1u<<1)
#define	LTDC_GCR_LTDCEN_B_0X0	(0x0u<<0)
#define	LTDC_GCR_LTDCEN_B_0X1	(0x1u<<0)

// GC1R Configuration

#define	LTDC_GC1R_BMA			(0x1u<<31)
#define	LTDC_GC1R_CRMA			(0x1u<<30)
#define	LTDC_GC1R_STRA			(0x1u<<29)
#define	LTDC_GC1R_DWP			(0x1u<<28)
#define	LTDC_GC1R_SPP			(0x1u<<27)
#define	LTDC_GC1R_TP			(0x1u<<25)
#define	LTDC_GC1R_LNIP			(0x1u<<24)
#define	LTDC_GC1R_BBA			(0x1u<<23)
#define	LTDC_GC1R_BCP			(0x1u<<22)
#define	LTDC_GC1R_SHRA			(0x1u<<21)
#define	LTDC_GC1R_GCT			(0x7u<<17)
#define	LTDC_GC1R_GCT_0			(0x1u<<17)
#define	LTDC_GC1R_DT			(0x3u<<14)
#define	LTDC_GC1R_DT_0			(0x1u<<14)
#define	LTDC_GC1R_PRBA			(0x1u<<12)
#define	LTDC_GC1R_WRCH			(0xFu<<8)
#define	LTDC_GC1R_WRCH_0		(0x1u<<8)
#define	LTDC_GC1R_WGCH			(0xFu<<4)
#define	LTDC_GC1R_WGCH_0		(0x1u<<4)
#define	LTDC_GC1R_WBCH			(0xFu<<0)
#define	LTDC_GC1R_WBCH_0		(0x1u<<0)

