hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_ltdc.h
#define	LTDC_GC1R_GCT_B_0X0		(0x0u<<17)
#define	LTDC_GC1R_GCT_B_0X1		(0x1u<<17)
#define	LTDC_GC1R_GCT_B_0X2		(0x2u<<17)
#define	LTDC_GC1R_DT_B_0X0		(0x0u<<14)
#define	LTDC_GC1R_DT_B_0X1		(0x1u<<14)
#define	LTDC_GC1R_DT_B_0X3		(0x3u<<14)

// GC2R Configuration

#define	LTDC_GC2R_BOA			(0x1u<<15)
#define	LTDC_GC2R_CRCA			(0x1u<<13)
#define	LTDC_GC2R_SFA			(0x1u<<12)
#define	LTDC_GC2R_SISA			(0x1u<<11)
#define	LTDC_GC2R_ROTA			(0x1u<<10)
#define	LTDC_GC2R_AXIIDA		(0x1u<<9)
#define	LTDC_GC2R_OCA			(0x1u<<8)
#define	LTDC_GC2R_EDCA			(0x1u<<7)
#define	LTDC_GC2R_BW			(0x7u<<4)
#define	LTDC_GC2R_BW_0			(0x1u<<4)
#define	LTDC_GC2R_DPA			(0x1u<<3)
#define	LTDC_GC2R_DVA			(0x1u<<2)
#define	LTDC_GC2R_STSA			(0x1u<<1)
#define	LTDC_GC2R_BLA			(0x1u<<0)

#define	LTDC_GC2R_BOA_B_0X0		(0x0u<<15)
#define	LTDC_GC2R_BOA_B_0X1		(0x1u<<15)
#define	LTDC_GC2R_CRCA_B_0X0	(0x0u<<13)
#define	LTDC_GC2R_CRCA_B_0X1	(0x1u<<13)
#define	LTDC_GC2R_SFA_B_0X0		(0x0u<<12)
#define	LTDC_GC2R_SFA_B_0X1		(0x1u<<12)
#define	LTDC_GC2R_SISA_B_0X0	(0x0u<<11)
#define	LTDC_GC2R_SISA_B_0X1	(0x1u<<11)
#define	LTDC_GC2R_BW_B_0X2		(0x2u<<4)
#define	LTDC_GC2R_BW_B_0X3		(0x3u<<4)
#define	LTDC_GC2R_BW_B_0X4		(0x4u<<4)

// SRCR Configuration

#define	LTDC_SRCR_VBR			(0x1u<<1)
#define	LTDC_SRCR_IMR			(0x1u<<0)

#define	LTDC_SRCR_VBR_B_0X0		(0x0u<<1)
#define	LTDC_SRCR_VBR_B_0X1		(0x1u<<1)
#define	LTDC_SRCR_IMR_B_0X0		(0x0u<<0)
#define	LTDC_SRCR_IMR_B_0X1		(0x1u<<0)

// GCCR Configuration

#define	LTDC_GCCR_REN			(0x1u<<18)
#define	LTDC_GCCR_GEN			(0x1u<<17)
#define	LTDC_GCCR_BEN			(0x1u<<16)
#define	LTDC_GCCR_COMP			(0xFFu<<8)
#define	LTDC_GCCR_COMP_0		(0x1u<<8)
#define	LTDC_GCCR_ADDR			(0xFFu<<0)
#define	LTDC_GCCR_ADDR_0		(0x1u<<0)

#define	LTDC_GCCR_REN_B_0X0		(0x0u<<18)
#define	LTDC_GCCR_REN_B_0X1		(0x1u<<18)
#define	LTDC_GCCR_GEN_B_0X0		(0x0u<<17)
#define	LTDC_GCCR_GEN_B_0X1		(0x1u<<17)
#define	LTDC_GCCR_BEN_B_0X0		(0x0u<<16)
#define	LTDC_GCCR_BEN_B_0X1		(0x1u<<16)

// BCCR Configuration

#define	LTDC_BCCR_BCRED			(0xFFu<<16)
#define	LTDC_BCCR_BCRED_0		(0x1u<<16)
#define	LTDC_BCCR_BCGREEN		(0xFFu<<8)
#define	LTDC_BCCR_BCGREEN_0		(0x1u<<8)
#define	LTDC_BCCR_BCBLUE		(0xFFu<<0)
#define	LTDC_BCCR_BCBLUE_0		(0x1u<<0)

// IER Configuration

#define	LTDC_IER_CRCIE			(0x1u<<7)
#define	LTDC_IER_FUIE			(0x1u<<6)
#define	LTDC_IER_RRIE			(0x1u<<3)
#define	LTDC_IER_TERRIE			(0x1u<<2)
#define	LTDC_IER_FUWIE			(0x1u<<1)
#define	LTDC_IER_LIE			(0x1u<<0)

#define	LTDC_IER_CRCIE_B_0X0	(0x0u<<7)
#define	LTDC_IER_CRCIE_B_0X1	(0x1u<<7)
#define	LTDC_IER_FUIE_B_0X0		(0x0u<<6)
#define	LTDC_IER_FUIE_B_0X1		(0x1u<<6)
#define	LTDC_IER_RRIE_B_0X0		(0x0u<<3)
#define	LTDC_IER_RRIE_B_0X1		(0x1u<<3)
#define	LTDC_IER_TERRIE_B_0X0	(0x0u<<2)
#define	LTDC_IER_TERRIE_B_0X1	(0x1u<<2)
#define	LTDC_IER_FUWIE_B_0X0	(0x0u<<1)
#define	LTDC_IER_FUWIE_B_0X1	(0x1u<<1)
#define	LTDC_IER_LIE_B_0X0		(0x0u<<0)
#define	LTDC_IER_LIE_B_0X1		(0x1u<<0)

// ISR Configuration

#define	LTDC_ISR_CRCIF			(0x1u<<7)
#define	LTDC_ISR_FUIF			(0x1u<<6)
#define	LTDC_ISR_RRIF			(0x1u<<3)
#define	LTDC_ISR_TERRIF			(0x1u<<2)
#define	LTDC_ISR_FUWIF			(0x1u<<1)
#define	LTDC_ISR_LIF			(0x1u<<0)

#define	LTDC_ISR_CRCIF_B_0X0	(0x0u<<7)
#define	LTDC_ISR_CRCIF_B_0X1	(0x1u<<7)
#define	LTDC_ISR_FUIF_B_0X0		(0x0u<<6)
#define	LTDC_ISR_FUIF_B_0X1		(0x1u<<6)
#define	LTDC_ISR_RRIF_B_0X0		(0x0u<<3)
#define	LTDC_ISR_RRIF_B_0X1		(0x1u<<3)
#define	LTDC_ISR_TERRIF_B_0X0	(0x0u<<2)
#define	LTDC_ISR_TERRIF_B_0X1	(0x1u<<2)
#define	LTDC_ISR_FUWIF_B_0X0	(0x0u<<1)
#define	LTDC_ISR_FUWIF_B_0X1	(0x1u<<1)
#define	LTDC_ISR_LIF_B_0X0		(0x0u<<0)
#define	LTDC_ISR_LIF_B_0X1		(0x1u<<0)

// ICR Configuration

#define	LTDC_ICR_CCRCIF			(0x1u<<7)
#define	LTDC_ICR_CFUIF			(0x1u<<6)
#define	LTDC_ICR_CRRIF			(0x1u<<3)
#define	LTDC_ICR_CTERRIF		(0x1u<<2)
#define	LTDC_ICR_CFUWIF			(0x1u<<1)
#define	LTDC_ICR_CLIF			(0x1u<<0)

#define	LTDC_ICR_CCRCIF_B_0X0	(0x0u<<7)
#define	LTDC_ICR_CCRCIF_B_0X1	(0x1u<<7)
#define	LTDC_ICR_CFUIF_B_0X0	(0x0u<<6)
#define	LTDC_ICR_CFUIF_B_0X1	(0x1u<<6)
#define	LTDC_ICR_CRRIF_B_0X0	(0x0u<<3)
#define	LTDC_ICR_CRRIF_B_0X1	(0x1u<<3)
#define	LTDC_ICR_CTERRIF_B_0X0	(0x0u<<2)
#define	LTDC_ICR_CTERRIF_B_0X1	(0x1u<<2)
#define	LTDC_ICR_CFUWIF_B_0X0	(0x0u<<1)
#define	LTDC_ICR_CFUWIF_B_0X1	(0x1u<<1)
#define	LTDC_ICR_CLIF_B_0X0		(0x0u<<0)
#define	LTDC_ICR_CLIF_B_0X1		(0x1u<<0)

// LIPCR Configuration

#define	LTDC_LIPCR_LIPOS		(0xFFFFu<<0)
#define	LTDC_LIPCR_LIPOS_0		(0x1u<<0)

// CPSR Configuration

#define	LTDC_CPSR_CXPOS			(0xFFFFu<<16)
#define	LTDC_CPSR_CXPOS_0		(0x1u<<16)
#define	LTDC_CPSR_CYPOS			(0xFFFFu<<0)
#define	LTDC_CPSR_CYPOS_0		(0x1u<<0)

// CDSR Configuration

#define	LTDC_CDSR_HSYNCS		(0x1u<<3)
#define	LTDC_CDSR_VSYNCS		(0x1u<<2)
#define	LTDC_CDSR_HDES			(0x1u<<1)
#define	LTDC_CDSR_VDES			(0x1u<<0)

#define	LTDC_CDSR_HSYNCS_B_0X0	(0x0u<<3)
#define	LTDC_CDSR_HSYNCS_B_0X1	(0x1u<<3)
#define	LTDC_CDSR_VSYNCS_B_0X0	(0x0u<<2)
#define	LTDC_CDSR_VSYNCS_B_0X1	(0x1u<<2)
#define	LTDC_CDSR_HDES_B_0X0	(0x0u<<1)
#define	LTDC_CDSR_HDES_B_0X1	(0x1u<<1)
#define	LTDC_CDSR_VDES_B_0X0	(0x0u<<0)
#define	LTDC_CDSR_VDES_B_0X1	(0x1u<<0)

// EDCR Configuration

#define	LTDC_EDCR_OCYCO			(0x1u<<27)
#define	LTDC_EDCR_OCYSEL		(0x1u<<26)
#define	LTDC_EDCR_OCYEN			(0x1u<<25)

#define	LTDC_EDCR_OCYCO_B_0X0	(0x0u<<27)
#define	LTDC_EDCR_OCYCO_B_0X1	(0x1u<<27)
#define	LTDC_EDCR_OCYSEL_B_0X0	(0x0u<<26)
#define	LTDC_EDCR_OCYSEL_B_0X1	(0x1u<<26)
#define	LTDC_EDCR_OCYEN_B_0X0	(0x0u<<25)
#define	LTDC_EDCR_OCYEN_B_0X1	(0x1u<<25)

// IER2 Configuration

#define	LTDC_IER2_CRCIE			(0x1u<<7)
#define	LTDC_IER2_FUIE			(0x1u<<6)
#define	LTDC_IER2_RRIE			(0x1u<<3)
#define	LTDC_IER2_TERRIE		(0x1u<<2)
#define	LTDC_IER2_FUWIE			(0x1u<<1)
#define	LTDC_IER2_LIE			(0x1u<<0)

#define	LTDC_IER2_CRCIE_B_0X0	(0x0u<<7)
#define	LTDC_IER2_CRCIE_B_0X1	(0x1u<<7)
#define	LTDC_IER2_FUIE_B_0X0	(0x0u<<6)
#define	LTDC_IER2_FUIE_B_0X1	(0x1u<<6)
#define	LTDC_IER2_RRIE_B_0X0	(0x0u<<3)
#define	LTDC_IER2_RRIE_B_0X1	(0x1u<<3)
#define	LTDC_IER2_TERRIE_B_0X0	(0x0u<<2)
#define	LTDC_IER2_TERRIE_B_0X1	(0x1u<<2)
#define	LTDC_IER2_FUWIE_B_0X0	(0x0u<<1)
#define	LTDC_IER2_FUWIE_B_0X1	(0x1u<<1)
#define	LTDC_IER2_LIE_B_0X0		(0x0u<<0)
#define	LTDC_IER2_LIE_B_0X1		(0x1u<<0)

