hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_ltdc.h
// ISR2 Configuration

#define	LTDC_ISR2_CRCIF			(0x1u<<7)
#define	LTDC_ISR2_FUIF			(0x1u<<6)
#define	LTDC_ISR2_RRIF			(0x1u<<3)
#define	LTDC_ISR2_TERRIF		(0x1u<<2)
#define	LTDC_ISR2_FUWIF			(0x1u<<1)
#define	LTDC_ISR2_LIF			(0x1u<<0)

#define	LTDC_ISR2_CRCIF_B_0X0	(0x0u<<7)
#define	LTDC_ISR2_CRCIF_B_0X1	(0x1u<<7)
#define	LTDC_ISR2_FUIF_B_0X0	(0x0u<<6)
#define	LTDC_ISR2_FUIF_B_0X1	(0x1u<<6)
#define	LTDC_ISR2_RRIF_B_0X0	(0x0u<<3)
#define	LTDC_ISR2_RRIF_B_0X1	(0x1u<<3)
#define	LTDC_ISR2_TERRIF_B_0X0	(0x0u<<2)
#define	LTDC_ISR2_TERRIF_B_0X1	(0x1u<<2)
#define	LTDC_ISR2_FUWIF_B_0X0	(0x0u<<1)
#define	LTDC_ISR2_FUWIF_B_0X1	(0x1u<<1)
#define	LTDC_ISR2_LIF_B_0X0		(0x0u<<0)
#define	LTDC_ISR2_LIF_B_0X1		(0x1u<<0)

// ICR2 Configuration

#define	LTDC_ICR2_CCRCIF		(0x1u<<7)
#define	LTDC_ICR2_CFUIF			(0x1u<<6)
#define	LTDC_ICR2_CRRIF			(0x1u<<3)
#define	LTDC_ICR2_CTERRIF		(0x1u<<2)
#define	LTDC_ICR2_CFUWIF		(0x1u<<1)
#define	LTDC_ICR2_CLIF			(0x1u<<0)

#define	LTDC_ICR2_CCRCIF_B_0X0	(0x0u<<7)
#define	LTDC_ICR2_CCRCIF_B_0X1	(0x1u<<7)
#define	LTDC_ICR2_CFUIF_B_0X0	(0x0u<<6)
#define	LTDC_ICR2_CFUIF_B_0X1	(0x1u<<6)
#define	LTDC_ICR2_CRRIF_B_0X0	(0x0u<<3)
#define	LTDC_ICR2_CRRIF_B_0X1	(0x1u<<3)
#define	LTDC_ICR2_CTERRIF_B_0X0	(0x0u<<2)
#define	LTDC_ICR2_CTERRIF_B_0X1	(0x1u<<2)
#define	LTDC_ICR2_CFUWIF_B_0X0	(0x0u<<1)
#define	LTDC_ICR2_CFUWIF_B_0X1	(0x1u<<1)
#define	LTDC_ICR2_CLIF_B_0X0	(0x0u<<0)
#define	LTDC_ICR2_CLIF_B_0X1	(0x1u<<0)

// LIPCR2 Configuration

#define	LTDC_LIPCR2_LIPOS		(0xFFFFu<<0)
#define	LTDC_LIPCR2_LIPOS_0		(0x1u<<0)

// ECRCR Configuration

#define	LTDC_ECRCR_ECRC			(0xFFFFu<<0)
#define	LTDC_ECRCR_ECRC_0		(0x1u<<0)

// CCRCR Configuration

#define	LTDC_CCRCR_CCRC			(0xFFFFu<<0)
#define	LTDC_CCRCR_CCRC_0		(0x1u<<0)

// FUTR Configuration

#define	LTDC_FUTR_THRE			(0xFFFFu<<0)
#define	LTDC_FUTR_THRE_0		(0x1u<<0)

// L1C0R Configuration

#define	LTDC_L1C0R_ARGB8888		(0x1u<<31)
#define	LTDC_L1C0R_ABGR8888		(0x1u<<30)
#define	LTDC_L1C0R_RGBA8888		(0x1u<<29)
#define	LTDC_L1C0R_BGRA888		(0x1u<<28)
#define	LTDC_L1C0R_RGB565		(0x1u<<27)
#define	LTDC_L1C0R_BGR565		(0x1u<<26)
#define	LTDC_L1C0R_RGB888		(0x1u<<25)
#define	LTDC_L1C0R_FF			(0x1u<<24)
#define	LTDC_L1C0R_F11PC		(0x1u<<23)
#define	LTDC_L1C0R_F1PC			(0x1u<<22)
#define	LTDC_L1C0R_F11C			(0x1u<<21)
#define	LTDC_L1C0R_F1C			(0x1u<<20)
#define	LTDC_L1C0R_F11P			(0x1u<<19)
#define	LTDC_L1C0R_F1P			(0x1u<<18)
#define	LTDC_L1C0R_F10			(0x1u<<17)
#define	LTDC_L1C0R_F11			(0x1u<<16)
#define	LTDC_L1C0R_F21PC		(0x1u<<15)
#define	LTDC_L1C0R_F2PC			(0x1u<<14)
#define	LTDC_L1C0R_F21C			(0x1u<<13)
#define	LTDC_L1C0R_F2C			(0x1u<<12)
#define	LTDC_L1C0R_F21P			(0x1u<<11)
#define	LTDC_L1C0R_F2P			(0x1u<<10)
#define	LTDC_L1C0R_F20			(0x1u<<9)
#define	LTDC_L1C0R_F21			(0x1u<<8)
#define	LTDC_L1C0R_CKRA			(0x1u<<7)
#define	LTDC_L1C0R_CLUTA		(0x1u<<6)
#define	LTDC_L1C0R_WINA			(0x1u<<5)
#define	LTDC_L1C0R_DCP			(0x1u<<4)
#define	LTDC_L1C0R_APA			(0x1u<<3)
#define	LTDC_L1C0R_CFBPA		(0x1u<<2)
#define	LTDC_L1C0R_CFBDA		(0x1u<<1)
#define	LTDC_L1C0R_CKTA			(0x1u<<0)

// L1C1R Configuration

#define	LTDC_L1C1R_SCA			(0x1u<<31)
#define	LTDC_L1C1R_YFPA			(0x1u<<2)
#define	LTDC_L1C1R_YSPA			(0x1u<<1)
#define	LTDC_L1C1R_YIA			(0x1u<<0)

#define	LTDC_L1C1R_SCA_B_0X0	(0x0u<<31)
#define	LTDC_L1C1R_SCA_B_0X1	(0x1u<<31)
#define	LTDC_L1C1R_YFPA_B_0X0	(0x0u<<2)
#define	LTDC_L1C1R_YFPA_B_0X1	(0x1u<<2)
#define	LTDC_L1C1R_YSPA_B_0X0	(0x0u<<1)
#define	LTDC_L1C1R_YSPA_B_0X1	(0x1u<<1)
#define	LTDC_L1C1R_YIA_B_0X0	(0x0u<<0)
#define	LTDC_L1C1R_YIA_B_0X1	(0x1u<<0)

// L1RCR Configuration

#define	LTDC_L1RCR_GRMSK		(0x1u<<2)
#define	LTDC_L1RCR_VBR			(0x1u<<1)
#define	LTDC_L1RCR_IMR			(0x1u<<0)

#define	LTDC_L1RCR_GRMSK_B_0X0	(0x0u<<2)
#define	LTDC_L1RCR_GRMSK_B_0X1	(0x1u<<2)
#define	LTDC_L1RCR_VBR_B_0X0	(0x0u<<1)
#define	LTDC_L1RCR_VBR_B_0X1	(0x1u<<1)
#define	LTDC_L1RCR_IMR_B_0X0	(0x0u<<0)
#define	LTDC_L1RCR_IMR_B_0X1	(0x1u<<0)

// L1CR Configuration

#define	LTDC_L1CR_DCBEN			(0x1u<<9)
#define	LTDC_L1CR_HMEN			(0x1u<<8)
#define	LTDC_L1CR_CLUTEN		(0x1u<<4)
#define	LTDC_L1CR_CKEN			(0x1u<<1)
#define	LTDC_L1CR_LEN			(0x1u<<0)

#define	LTDC_L1CR_DCBEN_B_0X0	(0x0u<<9)
#define	LTDC_L1CR_DCBEN_B_0X1	(0x1u<<9)
#define	LTDC_L1CR_HMEN_B_0X0	(0x0u<<8)
#define	LTDC_L1CR_HMEN_B_0X1	(0x1u<<8)
#define	LTDC_L1CR_CLUTEN_B_0X0	(0x0u<<4)
#define	LTDC_L1CR_CLUTEN_B_0X1	(0x1u<<4)
#define	LTDC_L1CR_CKEN_B_0X0	(0x0u<<1)
#define	LTDC_L1CR_CKEN_B_0X1	(0x1u<<1)
#define	LTDC_L1CR_LEN_B_0X0		(0x0u<<0)
#define	LTDC_L1CR_LEN_B_0X1		(0x1u<<0)

// L1WHPCR Configuration

#define	LTDC_L1WHPCR_WHSPPOS	(0xFFFFu<<16)
#define	LTDC_L1WHPCR_WHSPPOS_0	(0x1u<<16)
#define	LTDC_L1WHPCR_WHSTPOS	(0xFFFFu<<0)
#define	LTDC_L1WHPCR_WHSTPOS_0	(0x1u<<0)

// L1WVPCR Configuration

#define	LTDC_L1WVPCR_WVSPPOS	(0xFFFFu<<16)
#define	LTDC_L1WVPCR_WVSPPOS_0	(0x1u<<16)
#define	LTDC_L1WVPCR_WVSTPOS	(0xFFFFu<<0)
#define	LTDC_L1WVPCR_WVSTPOS_0	(0x1u<<0)

// L1CKCR Configuration

#define	LTDC_L1CKCR_CKRED		(0xFFu<<16)
#define	LTDC_L1CKCR_CKRED_0		(0x1u<<16)
#define	LTDC_L1CKCR_CKGREEN		(0xFFu<<8)
#define	LTDC_L1CKCR_CKGREEN_0	(0x1u<<8)
#define	LTDC_L1CKCR_CKBLUE		(0xFFu<<0)
#define	LTDC_L1CKCR_CKBLUE_0	(0x1u<<0)

// L1PFCR Configuration

#define	LTDC_L1PFCR_PF			(0x7u<<0)
#define	LTDC_L1PFCR_PF_0		(0x1u<<0)

#define	LTDC_L1PFCR_PF_B_0X0	(0x0u<<0)
#define	LTDC_L1PFCR_PF_B_0X1	(0x1u<<0)
#define	LTDC_L1PFCR_PF_B_0X2	(0x2u<<0)
#define	LTDC_L1PFCR_PF_B_0X3	(0x3u<<0)
#define	LTDC_L1PFCR_PF_B_0X4	(0x4u<<0)
#define	LTDC_L1PFCR_PF_B_0X5	(0x5u<<0)
#define	LTDC_L1PFCR_PF_B_0X6	(0x6u<<0)
#define	LTDC_L1PFCR_PF_B_0X7	(0x7u<<0)

// L1CACR Configuration

#define	LTDC_L1CACR_CONSTA		(0xFFu<<0)
#define	LTDC_L1CACR_CONSTA_0	(0x1u<<0)

// L1DCCR Configuration

#define	LTDC_L1DCCR_DCALPHA		(0xFFu<<24)
#define	LTDC_L1DCCR_DCALPHA_0	(0x1u<<24)
#define	LTDC_L1DCCR_DCRED		(0xFFu<<16)
#define	LTDC_L1DCCR_DCRED_0		(0x1u<<16)
#define	LTDC_L1DCCR_DCGREEN		(0xFFu<<8)
#define	LTDC_L1DCCR_DCGREEN_0	(0x1u<<8)
#define	LTDC_L1DCCR_DCBLUE		(0xFFu<<0)
#define	LTDC_L1DCCR_DCBLUE_0	(0x1u<<0)

