hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_ltdc.h
// L1BFCR Configuration

#define	LTDC_L1BFCR_BOR			(0x1u<<16)
#define	LTDC_L1BFCR_BF1			(0x7u<<8)
#define	LTDC_L1BFCR_BF1_0		(0x1u<<8)
#define	LTDC_L1BFCR_BF2			(0x7u<<0)
#define	LTDC_L1BFCR_BF2_0		(0x1u<<0)

#define	LTDC_L1BFCR_BOR_B_0X0	(0x0u<<16)
#define	LTDC_L1BFCR_BOR_B_0X1	(0x1u<<16)
#define	LTDC_L1BFCR_BF1_B_0X4	(0x4u<<8)
#define	LTDC_L1BFCR_BF1_B_0X6	(0x6u<<8)
#define	LTDC_L1BFCR_BF2_B_0X5	(0x5u<<0)
#define	LTDC_L1BFCR_BF2_B_0X7	(0x7u<<0)

// L1BLCR Configuration

#define	LTDC_L1BLCR_BL			(0xFFu<<0)
#define	LTDC_L1BLCR_BL_0		(0x1u<<0)

#define	LTDC_L1BLCR_BL_B_0X00	(0x0u<<0)
#define	LTDC_L1BLCR_BL_B_0X01	(0x1u<<0)
#define	LTDC_L1BLCR_BL_B_0X10	(0x10u<<0)

// L1PCR Configuration

#define	LTDC_L1PCR_YREN			(0x1u<<9)
#define	LTDC_L1PCR_OF			(0x1u<<8)
#define	LTDC_L1PCR_CBF			(0x1u<<7)
#define	LTDC_L1PCR_YF			(0x1u<<6)
#define	LTDC_L1PCR_YCM			(0x3u<<4)
#define	LTDC_L1PCR_YCM_0		(0x1u<<4)
#define	LTDC_L1PCR_YCEN			(0x1u<<3)

#define	LTDC_L1PCR_YREN_B_0X0	(0x0u<<9)
#define	LTDC_L1PCR_YREN_B_0X1	(0x1u<<9)
#define	LTDC_L1PCR_OF_B_0X0		(0x0u<<8)
#define	LTDC_L1PCR_OF_B_0X1		(0x1u<<8)
#define	LTDC_L1PCR_CBF_B_0X0	(0x0u<<7)
#define	LTDC_L1PCR_CBF_B_0X1	(0x1u<<7)
#define	LTDC_L1PCR_YF_B_0X0		(0x0u<<6)
#define	LTDC_L1PCR_YF_B_0X1		(0x1u<<6)
#define	LTDC_L1PCR_YCM_B_0X0	(0x0u<<4)
#define	LTDC_L1PCR_YCM_B_0X1	(0x1u<<4)
#define	LTDC_L1PCR_YCM_B_0X2	(0x2u<<4)
#define	LTDC_L1PCR_YCEN_B_0X0	(0x0u<<3)
#define	LTDC_L1PCR_YCEN_B_0X1	(0x1u<<3)

// L1CFBAR Configuration

#define	LTDC_L1CFBAR_CFBADD		(0xFFFFFFFFu<<0)
#define	LTDC_L1CFBAR_CFBADD_0	(0x1u<<0)

// L1CFBLR Configuration

#define	LTDC_L1CFBLR_CFBP		(0xFFFFu<<16)
#define	LTDC_L1CFBLR_CFBP_0		(0x1u<<16)
#define	LTDC_L1CFBLR_CFBLL		(0xFFFFu<<0)
#define	LTDC_L1CFBLR_CFBLL_0	(0x1u<<0)

// L1CFBLNR Configuration

#define	LTDC_L1CFBLNR_CFBLNBR	(0xFFFFu<<0)
#define	LTDC_L1CFBLNR_CFBLNBR_0	(0x1u<<0)

// L1AFBA0R Configuration

#define	LTDC_L1AFBA0R_AFBADD0	(0xFFFFFFFFu<<0)
#define	LTDC_L1AFBA0R_AFBADD0_0	(0x1u<<0)

// L1AFBA1R Configuration

#define	LTDC_L1AFBA1R_AFBADD1	(0xFFFFFFFFu<<0)
#define	LTDC_L1AFBA1R_AFBADD1_0	(0x1u<<0)

// L1AFBLR Configuration

#define	LTDC_L1AFBLR_AFBP		(0xFFFFu<<16)
#define	LTDC_L1AFBLR_AFBP_0		(0x1u<<16)
#define	LTDC_L1AFBLR_AFBLL		(0xFFFFu<<0)
#define	LTDC_L1AFBLR_AFBLL_0	(0x1u<<0)

// L1AFBLNR Configuration

#define	LTDC_L1AFBLNR_AFBLNBR	(0xFFFFu<<0)
#define	LTDC_L1AFBLNR_AFBLNBR_0	(0x1u<<0)

// L1CLUTWR Configuration

#define	LTDC_L1CLUTWR_CLUTADD	(0xFFu<<24)
#define	LTDC_L1CLUTWR_CLUTADD_0	(0x1u<<24)
#define	LTDC_L1CLUTWR_RED		(0xFFu<<16)
#define	LTDC_L1CLUTWR_RED_0		(0x1u<<16)
#define	LTDC_L1CLUTWR_GREEN		(0xFFu<<8)
#define	LTDC_L1CLUTWR_GREEN_0	(0x1u<<8)
#define	LTDC_L1CLUTWR_BLUE		(0xFFu<<0)
#define	LTDC_L1CLUTWR_BLUE_0	(0x1u<<0)

// L1CYR0R Configuration

#define	LTDC_L1CYR0R_CB2B		(0x3FFu<<16)
#define	LTDC_L1CYR0R_CB2B_0		(0x1u<<16)
#define	LTDC_L1CYR0R_CR2R		(0x3FFu<<0)
#define	LTDC_L1CYR0R_CR2R_0		(0x1u<<0)

// L1CYR1R Configuration

#define	LTDC_L1CYR1R_CB2G		(0x3FFu<<16)
#define	LTDC_L1CYR1R_CB2G_0		(0x1u<<16)
#define	LTDC_L1CYR1R_CR2G		(0x3FFu<<0)
#define	LTDC_L1CYR1R_CR2G_0		(0x1u<<0)

// L1FPF0R Configuration

#define	LTDC_L1FPF0R_RLEN		(0xFu<<14)
#define	LTDC_L1FPF0R_RLEN_0		(0x1u<<14)
#define	LTDC_L1FPF0R_RPOS		(0x1Fu<<9)
#define	LTDC_L1FPF0R_RPOS_0		(0x1u<<9)
#define	LTDC_L1FPF0R_ALEN		(0xFu<<5)
#define	LTDC_L1FPF0R_ALEN_0		(0x1u<<5)
#define	LTDC_L1FPF0R_APOS		(0x1Fu<<0)
#define	LTDC_L1FPF0R_APOS_0		(0x1u<<0)

// L1FPF1R Configuration

#define	LTDC_L1FPF1R_PSIZE		(0x7u<<18)
#define	LTDC_L1FPF1R_PSIZE_0	(0x1u<<18)
#define	LTDC_L1FPF1R_BLEN		(0xFu<<14)
#define	LTDC_L1FPF1R_BLEN_0		(0x1u<<14)
#define	LTDC_L1FPF1R_BPOS		(0x1Fu<<9)
#define	LTDC_L1FPF1R_BPOS_0		(0x1u<<9)
#define	LTDC_L1FPF1R_GLEN		(0xFu<<5)
#define	LTDC_L1FPF1R_GLEN_0		(0x1u<<5)
#define	LTDC_L1FPF1R_GPOS		(0x1Fu<<0)
#define	LTDC_L1FPF1R_GPOS_0		(0x1u<<0)

// L2C0R Configuration

#define	LTDC_L2C0R_ARGB8888		(0x1u<<31)
#define	LTDC_L2C0R_ABGR8888		(0x1u<<30)
#define	LTDC_L2C0R_RGBA8888		(0x1u<<29)
#define	LTDC_L2C0R_BGRA888		(0x1u<<28)
#define	LTDC_L2C0R_RGB565		(0x1u<<27)
#define	LTDC_L2C0R_BGR565		(0x1u<<26)
#define	LTDC_L2C0R_RGB888		(0x1u<<25)
#define	LTDC_L2C0R_FF			(0x1u<<24)
#define	LTDC_L2C0R_F11PC		(0x1u<<23)
#define	LTDC_L2C0R_F1PC			(0x1u<<22)
#define	LTDC_L2C0R_F11C			(0x1u<<21)
#define	LTDC_L2C0R_F1C			(0x1u<<20)
#define	LTDC_L2C0R_F11P			(0x1u<<19)
#define	LTDC_L2C0R_F1P			(0x1u<<18)
#define	LTDC_L2C0R_F10			(0x1u<<17)
#define	LTDC_L2C0R_F11			(0x1u<<16)
#define	LTDC_L2C0R_F21PC		(0x1u<<15)
#define	LTDC_L2C0R_F2PC			(0x1u<<14)
#define	LTDC_L2C0R_F21C			(0x1u<<13)
#define	LTDC_L2C0R_F2C			(0x1u<<12)
#define	LTDC_L2C0R_F21P			(0x1u<<11)
#define	LTDC_L2C0R_F2P			(0x1u<<10)
#define	LTDC_L2C0R_F20			(0x1u<<9)
#define	LTDC_L2C0R_F21			(0x1u<<8)
#define	LTDC_L2C0R_CKRA			(0x1u<<7)
#define	LTDC_L2C0R_CLUTA		(0x1u<<6)
#define	LTDC_L2C0R_WINA			(0x1u<<5)
#define	LTDC_L2C0R_DCP			(0x1u<<4)
#define	LTDC_L2C0R_APA			(0x1u<<3)
#define	LTDC_L2C0R_CFBPA		(0x1u<<2)
#define	LTDC_L2C0R_CFBDA		(0x1u<<1)
#define	LTDC_L2C0R_CKTA			(0x1u<<0)

// L2C1R Configuration

#define	LTDC_L2C1R_SCA			(0x1u<<31)
#define	LTDC_L2C1R_YFPA			(0x1u<<2)
#define	LTDC_L2C1R_YSPA			(0x1u<<1)
#define	LTDC_L2C1R_YIA			(0x1u<<0)

#define	LTDC_L2C1R_SCA_B_0X0	(0x0u<<31)
#define	LTDC_L2C1R_SCA_B_0X1	(0x1u<<31)
#define	LTDC_L2C1R_YFPA_B_0X0	(0x0u<<2)
#define	LTDC_L2C1R_YFPA_B_0X1	(0x1u<<2)
#define	LTDC_L2C1R_YSPA_B_0X0	(0x0u<<1)
#define	LTDC_L2C1R_YSPA_B_0X1	(0x1u<<1)
#define	LTDC_L2C1R_YIA_B_0X0	(0x0u<<0)
#define	LTDC_L2C1R_YIA_B_0X1	(0x1u<<0)

// L2RCR Configuration

#define	LTDC_L2RCR_GRMSK		(0x1u<<2)
#define	LTDC_L2RCR_VBR			(0x1u<<1)
#define	LTDC_L2RCR_IMR			(0x1u<<0)

#define	LTDC_L2RCR_GRMSK_B_0X0	(0x0u<<2)
#define	LTDC_L2RCR_GRMSK_B_0X1	(0x1u<<2)
#define	LTDC_L2RCR_VBR_B_0X0	(0x0u<<1)
#define	LTDC_L2RCR_VBR_B_0X1	(0x1u<<1)
#define	LTDC_L2RCR_IMR_B_0X0	(0x0u<<0)
#define	LTDC_L2RCR_IMR_B_0X1	(0x1u<<0)

// L2CR Configuration

#define	LTDC_L2CR_DCBEN			(0x1u<<9)
#define	LTDC_L2CR_HMEN			(0x1u<<8)
#define	LTDC_L2CR_CLUTEN		(0x1u<<4)
#define	LTDC_L2CR_CKEN			(0x1u<<1)
#define	LTDC_L2CR_LEN			(0x1u<<0)

